Catalogs/атл_ПодразделенияКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>атл_ПодразделенияКонтрагента</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресШирота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДолгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/атл_ПодразделенияКонтрагента/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Местонахождение(Команда)
	
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаПараметровОткрытия", АдресТаблицы);
	ПараметрыФормы.Вставить("НеИнтерактивноеОткрытие", Истина);
	ПараметрыФормы.Вставить("ВводКоординаты", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", "Адрес подразделения контрагента");
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработкаВводаКоординат", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.атл_ОтображениеТочекСТрекомНаКарте.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, ОповещениеФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТаблицаПараметровОткрытия = атл_УправлениеМобильнымиСотрудникамиСервер.СформироватьТаблицуСписокПараметровОткрытияДляОткрытияКарты();
	
	мНоваяСтрока = ТаблицаПараметровОткрытия.Добавить();
	мНоваяСтрока.Объект = Объект.Ссылка;
	мНоваяСтрока.Примечание = Объект.Адрес;
	Если ЗначениеЗаполнено(Объект.АдресШирота) И ЗначениеЗаполнено(Объект.АдресДолгота) Тогда
		мНоваяСтрока.ВидОбъекта = "ТочкаНаКарте";	
		мНоваяСтрока.Широта = Объект.АдресШирота;
		мНоваяСтрока.Долгота = Объект.АдресДолгота;
	Иначе
		мНоваяСтрока.ВидОбъекта = "АдресДляПоискаНаКарте";				
	КонецЕсли;
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОткрытия, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВводаКоординат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("Строка") И НЕ РезультатЗакрытия = "" тогда
		НайденныйРазделитель = Найти(РезультатЗакрытия, ";");
		Если НайденныйРазделитель > 0 Тогда
			Объект.АдресДолгота = Сред(РезультатЗакрытия, 1, НайденныйРазделитель - 1);
			Объект.АдресШирота = Сред(РезультатЗакрытия, НайденныйРазделитель + 1);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
